[
  {
    "company": "TechCorp Solutions",
    "position": "Senior Software Engineer",
    "location": "Remote",
    "period": "2020 - Present",
    "description": "Lead developer for enterprise web applications with focus on React, Node.js, and cloud infrastructure.",
    "highlights": [
      "Architected and developed a scalable e-commerce platform serving 50,000+ daily users",
      "Reduced API response time by 40% through optimized backend architecture",
      "Implemented CI/CD pipelines that decreased deployment time by 60%",
      "Mentored junior developers and conducted code reviews to maintain high quality standards"
    ]
  },
  {
    "company": "InnovateTech",
    "position": "Full Stack Developer",
    "location": "Lagos, Nigeria",
    "period": "2018 - 2020",
    "description": "Developed and maintained web applications for clients in fintech and e-commerce sectors.",
    "highlights": [
      "Built a payment processing system integrated with multiple African payment gateways",
      "Developed a real-time inventory management system using React, Node.js and Socket.io",
      "Optimized database queries resulting in 30% faster page load times",
      "Collaborated with UX designers to implement responsive, accessible interfaces"
    ]
  },
  {
    "company": "DataSystems Ltd",
    "position": "Frontend Developer",
    "location": "Lagos, Nigeria",
    "period": "2016 - 2018",
    "description": "Created responsive user interfaces for web applications focusing on user experience and performance.",
    "highlights": [
      "Developed responsive dashboards using React and D3.js for data visualization",
      "Implemented state management with Redux across multiple complex applications",
      "Converted legacy jQuery applications to modern React architecture",
      "Improved application load time by 50% through code splitting and lazy loading"
    ]
  },
  {
    "company": "CodeWave",
    "position": "Junior Web Developer",
    "location": "Abuja, Nigeria",
    "period": "2014 - 2016",
    "description": "Started as an intern and grew into a full-time developer role working on client websites and applications.",
    "highlights": [
      "Developed and maintained client websites using HTML, CSS, JavaScript, and PHP",
      "Created custom WordPress themes and plugins for small business clients",
      "Assisted senior developers with debugging and feature implementation",
      "Participated in regular code reviews and technical knowledge sharing sessions"
    ]
  }
]